// KANNADA

// Design:
// tasks -> situations
// instance has many situations

const t=5;

/*
    Structure of Task:
    {
        index: number
        text: text,
        choice1/2/3: text,
        delta1/2/3: [array of score changes], i.e. 
            Economic Growth, 
            Public Support, 
            Transparency and Accountability, 
            Government Stability
        delta1/2/3p: [array of changes in preamble], i.e.
            Social, 
            Economic, 
            Political, 
            Thought, 
            Expression, 
            Belief, 
            Faith, 
            Worship, 
            Status, 
            Opportunity, 
            SOCIALIST, 
            SECULAR, 
            DEMOCRATIC, 
            FRATERNITY
    }

*/

const task0 = {
    index: 0,
    text: `ಸಂಸತ್ತು ಹೊಸ ಕಾನೂನನ್ನು ಅಂಗೀಕರಿಸಿದೆ, ಇದು ಅರಣ್ಯದಲ್ಲಿನ ಜೀವವೈವಿಧ್ಯತೆಯ ರಕ್ಷಣೆಗೆ ಗ್ರಾಮ ಸಮುದಾಯಗಳು ಜವಾಬ್ದಾರರಾಗಿರುತ್ತವೆ ಎಂದು ಹೇಳುತ್ತದೆ. ಕಾನೂನು ಗ್ರಾಮ ಸಮುದಾಯಗಳಿಗೆ ಅರಣ್ಯ ಗ್ರಾಮಗಳನ್ನು ಕಂದಾಯ ಗ್ರಾಮಗಳಾಗಿ ಪರಿವರ್ತಿಸುವ ಹಕ್ಕನ್ನು ನೀಡುತ್ತದೆ, ನಿರ್ಮಾಣ, ಮಾರಾಟ ಮತ್ತು ವಾಣಿಜ್ಯ ಚಟುವಟಿಕೆಗಳಿಗೆ ಅವಕಾಶ ನೀಡುತ್ತದೆ.`,
    choice1: `ಅಂತಹ ಕ್ರಮದಿಂದ ಕೇವಲ ಗ್ರಾಮದ ಪ್ರಭಾವಿ ಸಮುದಾಯಗಳಿಗೆ ಮಾತ್ರ ಅನುಕೂಲವಾಗುತ್ತದೆ ಮತ್ತು ಕಾಲಾನಂತರದಲ್ಲಿ ಅರಣ್ಯ ಭೂಮಿಯ ಅವನತಿಗೆ ಕಾರಣವಾಗುತ್ತದೆ ಎಂದು ಸಂರಕ್ಷಣಾಕಾರರು ಕಾನೂನಿನ ವಿರುದ್ಧ ವಾದ ಮಾಡುತ್ತಾರೆ.<br/><br/>
    ಕಾನೂನನ್ನು ರದ್ದುಗೊಳಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ನಾಗರಿಕ ಸಮಾಜದ ಒಂದು ದೊಡ್ಡ ಭಾಗ ಕಾನೂನಿನ ಪರವಾಗಿ ವಾದಿಸುತ್ತದೆ, ಇದು ಅಂತಿಮವಾಗಿ ಭೂಮಿಯ ಮೇಲಿನ ಆಡಳಿತವನ್ನು ವಿಕೇಂದ್ರೀಕರಿಸುತ್ತದೆ ಮತ್ತು ಸ್ಥಳೀಯ ಸಮುದಾಯಗಳಿಗೆ ಅವು ತಮ್ಮ ಅಗತ್ಯಗಳಿಗಾಗಿ ಯೋಜಿಸಲು ಅವಕಾಶ ನೀಡುತ್ತದೆ.<br/><br/>
    ಸ್ಥಳೀಯ ಆಡಳಿತದ ನಿಬಂಧನೆಗಳನ್ನು ಶೀಘ್ರವಾಗಿ ತಿಳಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಇದು ಸ್ಥಳೀಯ ಸಮುದಾಯಗಳಿಗೆ ಉತ್ತಮ ಆಹಾರ ಭದ್ರತೆ ಮತ್ತು ಜೀವನೋಪಾಯದ ಅವಕಾಶಗಳನ್ನು ಸುಧಾರಣೆಗೆ ಅನುವು ಮಾಡಿಕೊಡುತ್ತದೆ ಎಂದು ಉದ್ಯಮ ಮತ್ತು ರೈತ ಸಂಘವು ಕಾನೂನಿನ ಪರವಾಗಿ ವಾದಿಸುತ್ತವೆ.<br/><br/>
    ಕಾನೂನನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಜಾರಿಗೊಳಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [-t, t, 0, -t],
    delta2: [-t, t, t, 0],
    delta3: [t, 2*t, -t, t],
    delta1p:[-1,0,0,1,1,0,0,0,-1,0,0,0,0,1],
    delta2p:[0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1],
    delta3p:[0, 1, 0, 0, 0, 0, 0, 0, 0, -1, -1, 0, 0, -1]
};

const task1 = {
    index: 1,
    text: `ಟಿವಿ ಸುದ್ದಿಗಳಲ್ಲಿ ದ್ವೇಷಪೂರಿತ ಭಾಷಣ ಇರುವ ಬಗ್ಗೆ ಟ್ವೀಟ್ ಮಾಡಿದ್ದಕ್ಕಾಗಿ ಜನಪ್ರಿಯ ಸುದ್ದಿ ವಾಹಿನಿಯ ಸಂಪಾದಕರನ್ನು ವಜಾಗೊಳಿಸಲಾಗಿದೆ. ಚಾನೆಲ್‌ನ ವ್ಯವಹಾರಗಳ ಬಗ್ಗೆ ವಿರುದ್ಧವಾಗಿ ಕಾಮೆಂಟ್ ಮಾಡಿರುವುದು ತಮ್ಮ ಆಂತರಿಕ ನಿಯಮದ ಉಲ್ಲಂಘನೆಯಾಗಿದೆ ಎಂದು ಮ್ಯಾನೇಜ್‌ಮೆಂಟ್ ಹೇಳಿಕೊಂಡಿದೆ. ಸಂಪಾದಕರು ಸ್ಪಷ್ಟವಾಗಿ ಯಾವುದೇ ಚಾನಲ್ ನ ಹೆಸರನ್ನು ನಿಖರವಾಗಿ ಹೇಳಿಲ್ಲ.`,
    choice1: `ಸಂಪಾದಕರು ಸಾಮಾಜಿಕ ಮಾಧ್ಯಮದಲ್ಲಿ ಯಾವುದೇ ಅಭಿಪ್ರಾಯವನ್ನು ವ್ಯಕ್ತಪಡಿಸಲು ಸಾಧ್ಯವಾಗುವಂತಿರಬೇಕು.ತಮ್ಮ ಭಾಷಣವನ್ನು ಸಂವಿಧಾನ ರಕ್ಷಿಸುವವರೆಗೆ ಅದು ಸಾಧ್ಯ ಎಂದು ಟಿವಿ ಎಡಿಟರ್ಸ್ ಗಿಲ್ಡ್ ವಾದಿಸುತ್ತದೆ.<br/><br/>
    ಸಂಪಾದಕರನ್ನು ಮರುಸ್ಥಾಪಿಸುವ ಮತ್ತು ಕ್ಷಮೆಯಾಚಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2: `ಲಕ್ಷಾಂತರ ವೀಕ್ಷಕರೊಂದಿಗೆ ಮಾತನಾಡುವ ಸಂಪಾದಕರು ಹೇಳಿಕೆಗಳನ್ನು ನೀಡುವಾಗ ಹೆಚ್ಚು ಜವಾಬ್ದಾರಿಯಿಂದ ಇರಬೇಕು ಮತ್ತು ಅಂತಹ ಪರಿಶೀಲಿಸದ ಅಭಿಪ್ರಾಯವು ಟಿವಿ ಸುದ್ದಿ ವೀಕ್ಷಕರನ್ನು ನಿರುತ್ಸಾಹಗೊಳಿಸುತ್ತದೆ ಎಂದು ಸುದ್ದಿ ಚಾನೆಲ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್ ವಾದಿಸುತ್ತದೆ.<br/><br/>
    ಸಂಪಾದಕರನ್ನು ವಜಾಗೊಳಿಸುವ ಮತ್ತು ನೋ-ಕಾಮೆಂಟ್ ನೀತಿಯನ್ನು ಕಾಪಾಡಿಕೊಳ್ಳುವ ಅವರ ನಿರ್ಧಾರವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಅಂತಹ ಹೇಳಿಕೆಯನ್ನು ಗಂಭೀರವಾಗಿ ಪರಿಗಣಿಸಬೇಕು ಮತ್ತು ಎಲ್ಲಾ ವೀಕ್ಷಕರ ಅನುಕೂಲಕ್ಕಾಗಿ ಹೆಚ್ಚಿನ ತನಿಖೆ ನಡೆಸಬೇಕು ಎಂದು ನ್ಯೂಸ್ ಬ್ರಾಡ್‌ಕಾಸ್ಟಿಂಗ್ ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಅಥಾರಿಟಿ (ಎನ್‌ಬಿಎಸ್‌ಎ) ವಾದಿಸುತ್ತದೆ.<br/><br/>
    ಚಾನಲ್ ಅನ್ನು ತಾತ್ಕಾಲಿಕವಾಗಿ ನಿಷೇಧಿಸಲು ಮತ್ತು ಟಿವಿ ಸುದ್ದಿಗಳಲ್ಲಿ ದ್ವೇಷಪೂರಿತ ವಿಷಯದ ಕುರಿತು ನಿಯಮಗಳನ್ನು ರೂಪಿಸಲು ಅವರ ಕಾರ್ಯಕಲಾಪಗಳನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [-t, t, t, 0],
    delta2: [t, 0, -t, t],
    delta3: [-2*t, t, 0, t],
    delta1p:[0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0],
    delta2p:[0, 0, 0, -1, -1, 0, 0, 0, -1, 0, 0, 0, 0, 0],
    delta3p:[0, 0, 1, 1, -1, 0, 0, 0, 0, 0, 0, 0, 1, 0]
};

const task2 = {
    index: 2,
    text: `ರಾಜ್ಯ ಸರ್ಕಾರ ಒಂದು ತೈಲ ಸಂಸ್ಕರಣಾಗಾರದ ವಿಸ್ತರಣೆಗೆ ಸ್ಥಳಾವಕಾಶ ಮಾಡಿಕೊಡಲು ಯೋಜಿಸಿದೆ. ಇದಕ್ಕಾಗಿ ಅಕ್ಕಪಕ್ಕದ ಸರ್ಕಾರಿ ಜಮೀನು ಮಂಜೂರು ಮಾಡಿದ್ದು, ಕಳೆದ 3 ವರ್ಷಗಳಿಂದ ಅಲ್ಲಿ ನೆಲೆಸಿದ್ದ ಸ್ಲಂ ನಿವಾಸಿಗಳನ್ನು ಹೊರಹಾಕಿದೆ. ಅವರಿಗೆ ಪುನರ್ವಸತಿ ಕಲ್ಪಿಸಲಾಗುವುದು ಎಂದು ಸರ್ಕಾರ ಹೇಳಿದೆ.`,
    choice1: `ರಾಜ್ಯದ ಇಂಧನ ಅಗತ್ಯಗಳನ್ನು ಪೂರೈಸಲು ವಿಸ್ತರಣೆಯು ನಿರ್ಣಾಯಕವಾಗಿದೆ ಮತ್ತು ಅನೇಕ ಜೀವನೋಪಾಯದ ಅವಕಾಶಗಳನ್ನು ಸೃಷ್ಟಿಸುತ್ತದೆ ಎಂದು ರಾಜ್ಯ ಸರ್ಕಾರ ವಾದಿಸುತ್ತದೆ.<br/><br/>
    ಸ್ಲಂ ನಿವಾಸಿಗಳನ್ನು ಪ್ರೈಮ್ ಲ್ಯಾಂಡ್ ನಿಂದ ಹೊರಹಾಕುವ ಮತ್ತು ವಿಸ್ತರಣೆಯನ್ನು ಪ್ರಾರಂಭಿಸುವ ಅವರ ನಿರ್ಧಾರವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಈ ಪುನರ್ವಸತಿಯು ಅವರುಗಳು ತಮ್ಮ ಜೀವನೋಪಾಯಕ್ಕಾಗಿ ಕೆಲಸ ಮಾಡುತ್ತಿರುವ ನಗರದಿಂದ ಅವರನ್ನು, ದೂರಕ್ಕೆ ಸ್ಥಳಾಂತರಿಸುತ್ತದೆ ಎಂದು ಹೊರಹಾಕಲ್ಪಟ್ಟ ಕೊಳೆಗೇರಿ ನಿವಾಸಿಗಳನ್ನು ಪ್ರತಿನಿಧಿಸುವ ನಾಗರಿಕ ಸಮಾಜ ಸಂಸ್ಥೆಗಳು ವಾದಿಸುತ್ತವೆ. ಅವರಲ್ಲಿ ಯಾರೂ ಹೊಸ ಸಂಸ್ಕರಣಾಗಾರದಲ್ಲಿಯ ಉದ್ಯೋಗಗಳಿಗೆ ಅರ್ಹರಾಗಿರುವುದಿಲ್ಲ ಎಂದು ಅವರು ಹೇಳುತ್ತಾರೆ.<br/><br/>
    ಕೊಳೆಗೇರಿ ನಿವಾಸಿಗಳಿಗೆ ಸ್ಥಳದಲ್ಲೇ ಪುನರ್ವಸತಿ ಮತ್ತು ಸಂಸ್ಕರಣಾಗಾರದ ಉದ್ಯೋಗದಲ್ಲಿ ಆದ್ಯತೆ ಎನ್ನುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ತೈಲ ಸಂಸ್ಕರಣಾಗಾರದ ವಿಸ್ತರಣೆಯು ಜೈವಿಕ ಇಂಧನ ಆಧಾರಿತ ಶಕ್ತಿಯ ಮೇಲಿನ ಅವಲಂಬನೆಯನ್ನು ಹೆಚ್ಚಿಸುವ ಮೂಲಕ ಹವಾಮಾನಕ್ಕೆ ಹಾನಿಮಾಡುವುದರ. ಜೊತೆಗೆ ಎಲ್ಲಾ ನಗರದ ನಿವಾಸಿಗಳನ್ನು ಅಪಾಯಕ್ಕೆ ಸಿಲುಕಿಸುತ್ತದೆ ಎಂದು ಪರಿಸರವಾದಿಗಳು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ವಿಸ್ತರಣೆ ಯೋಜನೆಯನ್ನು ಹಿಂತೆಗೆದುಕೊಳ್ಳುವ, ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ ಸ್ಥಾವರವನ್ನು ಮುಚ್ಚುವ ಮತ್ತು ಸೋಲಾರ್ ಫಾರ್ಮ್ ಅನ್ನು ಸ್ಥಾಪಿಸಲು ಆ ಜಾಗವನ್ನು ಬಳಸಬೇಕೆಂಬ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [2*t, t, -t, t],
    delta2: [t, t, -t, -t],
    delta3: [-2*t, -t, t, -t],
    delta1p:[-1, 1, 0, -1, -1, 0, 0, 0, 0, -1, 0, 0, -1, 0],
    delta2p:[1, -1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1],
    delta3p:[0, -1, -1, 1, 1, 0, 0, 0, 0, -1, -1, 0, 1, -1]
};

const task3 = {
    index: 3,
    text: `ನಗರದ ಮೆಟ್ರೋ ಅಧಿಕಾರಿಗಳು ಪಾರ್ಸಿಗಳ ಒಂದು ಅಗ್ನಿ ದೇವಾಲಯದ ಕೆಳಗೆ ಸುರಂಗ ತೋಡಲು ಯೋಜಿಸಿದ್ದಾರೆ. ನಿರ್ಮಾಣದ ಅವಧಿಯಲ್ಲಿ ದೇವಾಲಯದ ಪ್ರವೇಶವನ್ನು ನಿರ್ಬಂಧಿಸಲಾಗುತ್ತದೆ. ದೇವಸ್ಥಾನವನ್ನು ಸ್ಥಳಾಂತರಿಸಲು ಮತ್ತು ಅದರ ಪುನರ್ನಿರ್ಮಾಣಕ್ಕೆ ಬೇಕಾದ ಹಣ ನೀಡಲು ಸರ್ಕಾರ ಮುಂದಾಗಿದೆ.`,
    choice1: `ಹತ್ತಿರದ ಪ್ರದೇಶಗಳಲ್ಲಿರುವ ಜನರಿಗೆ ಸಾರ್ವಜನಿಕ ಸಾರಿಗೆ ಪ್ರವೇಶ ಸುಧಾರಿಸಲು ಸುರಂಗ ತುಂಬಾ ಮುಖ್ಯ ಎಂದು ಮೆಟ್ರೋ ಅಧಿಕಾರಿಗಳು ವಾದಿಸುತ್ತಾರೆ. 4 ವರ್ಷಗಳ ಹಿಂದೆಯೇ ಯೋಜನೆಗಳನ್ನು ಅಂತಿಮಗೊಳಿಸಲಾಗಿದೆ ಎಂದು ಅವರು ಹೇಳುತ್ತಾರೆ.<br/><br/>
    ಅಗ್ನಿ ದೇವಾಲಯದ ಪಕ್ಕದಲ್ಲಿ ನಿಲ್ದಾಣವನ್ನು ನಿರ್ಮಿಸುವ ಅವರ ನಿರ್ಧಾರವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಯೋಜನಾ ಪ್ರಕ್ರಿಯೆಯಲ್ಲಿ ತಮ್ಮನ್ನು ಸಮಾಲೋಚಿಸಲಾಗಿಲ್ಲ ಎಂದು ಪಾರ್ಸಿ ಪ್ರತಿನಿಧಿಗಳು ವಾದಿಸುತ್ತಾರೆ. ಕಾಂಪೌಂಡ್ ಅಡಿಯಲ್ಲಿಯಲ್ಲಿಯೇ ನಿರ್ಮಾಣ ಮಾಡುವುದರಿಂದ ದೇವಾಲಯದ ಪಾವಿತ್ರ್ಯತೆಯನ್ನು ಕಸಿದುಕೊಳ್ಳುತ್ತದೆ ಮತ್ತು ಸದ್ಯದ ಭವಿಷ್ಯದಲ್ಲಿ ಪ್ರವೇಶವನ್ನು ತಡೆಯುತ್ತದೆ.<br/><br/>
    ಸಾರ್ವಜನಿಕ ಚರ್ಚೆಗಳನ್ನು ಪುನರಾರಂಭಿಸಲು ಮತ್ತು ಮಾರ್ಗದ ಮರುಜೋಡಣೆಯ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಸರ್ಕಾರವು ಧಾರ್ಮಿಕ ಅಭಿವ್ಯಕ್ತಿಯ ವಿಷಯಗಳಲ್ಲಿ ಭಾಗಿಯಾಗಬಾರದು ಮತ್ತು ದೇವಾಲಯದ ಪುನರ್ನಿರ್ಮಾಣಕ್ಕೆ ಹಣಕಾಸು ಒದಗಿಸುವ ಮೂಲಕ ಜಾತ್ಯತೀತ ತತ್ವಗಳನ್ನು ಉಲ್ಲಂಘಿಸಿದಂತಾಗುತ್ತದೆ ಎಂದು ಕಾರ್ಯಕರ್ತರ ಗುಂಪುಗಳು ವಾದಿಸುತ್ತವೆ.<br/><br/>
    ಅಗ್ನಿ ದೇವಾಲಯಕ್ಕಾಗಿ ಯಾವುದೇ ಸರ್ಕಾರಿ ಸೌಲಭ್ಯ ನೀಡುವುದರ ವಿರುದ್ಧದ ಯೋಜನೆಯಂತೆ ನಿರ್ಮಾಣವನ್ನು ಮುಂದುವರಿಸ ಬೇಕು ಎನ್ನುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [0, t, -t, t],
    delta2: [-t, -t, 2*t, -t],
    delta3: [0, t, -t, -t],
    delta1p:[0, 1, 0, -1, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    delta2p:[0, 0, 1, 1, 1, 1, 1, 1, 0, 0, -1, 1, 1, 1],
    delta3p:[-1, 0, 0, 1, 1, -1, -1, -1, -1, 0, 0, -1, 0, -1]
};

const task4 = {
    index: 4,
    text: `ವ್ಯಾಪಾರಸ್ಥರು, ಬೀದಿಬದಿಯ ವ್ಯಾಪಾರಿಗಳಿಂದ ತೊಂದರೆಯಾಗುತ್ತಿದೆ ಎಂಬ ದೂರುಗಳ ಆಧಾರದ ಮೇಲೆ ನಗರದ ಅಭಿವೃದ್ಧಿ ಪ್ರಾಧಿಕಾರ ಒಂದು ಹಳೆಯ ವಸತಿ ಪ್ರದೇಶದಲ್ಲಿನ ಮಾರಾಟಗಾರರನ್ನು ಹೊರಹಾಕಿದೆ. ಈಗ ಆ ಜಾಗವನ್ನು ಅಲ್ಲಿಯ ರಸ್ತೆಗಳನ್ನು ವಿಸ್ತರಿಸಲು ಬಳಸಲಾಗುತ್ತದೆ.`,
    choice1: `ತಮ್ಮ ಜೀವನ ನಿರ್ವಹಣೆಗೆ ವ್ಯಾಪಾರ ಮಾಡುವ ಮತ್ತು ಗಳಿಸುವ ಹಕ್ಕಿದೆ ಎನ್ನುವುದು ಬೀದಿ ವ್ಯಾಪಾರಿಗಳು ಮತ್ತು ಅವರ ಪ್ರತಿನಿಧಿ ಸಂಘಗಳು ವಾದವಾಗಿದೆ. ಅವರನ್ನು ಹೊರಹಾಕುವುದರಿಂದ ಅವರ ಆದಾಯ ನಾಶವಾಗುತ್ತದೆ. 20 ವರ್ಷಗಳಿಂದಲೂ ಅಲ್ಲಿ ವ್ಯಾಪಾರ ಮಾಡುತ್ತಿರುವ ಈ ಪ್ರದೇಶದಲ್ಲಿನ ಮಾರಾಟಗಾರರ ಬಳಿಗೆ ಅನೇಕ ಖರೀದಿದಾರರು ಬರುತ್ತಾರೆ. ಬೀದಿ ಬದಿಯವ್ಯಾಪಾರಿಗಳು ಇಲ್ಲದಿದ್ದರೆ ಹಿಂದೆ ಅಲ್ಲಿಗೆ ಬರುವವರ ಸಂಖ್ಯೆಯೂ , ಕಡಿಮೆಯಾಗುತ್ತದೆ ಎಂದು ಅವರು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ಮಾರಾಟಕ್ಕಾಗಿ ತಮ್ಮ ಜಾಗವನ್ನು ಮರುಸ್ಥಾಪಿಸುವ ಮತ್ತು ಚಟುವಟಿಕೆಗಳನ್ನು ಮುಂದುವರಿಸಲು ಅಭಿವೃದ್ಧಿ ಪ್ರಾಧಿಕಾರದಿಂದ ಪ್ರಮಾಣಪತ್ರಗಳನ್ನು ಪಡೆಯುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಬೀದಿಬದಿಯ ವ್ಯಾಪಾರಿಗಳು ಒತ್ತುವರಿ ಮಾಡಿಕೊಂಡಿರುವ ಜಮೀನಿನ ಮೇಲೆ ಅವರಿಗೆ ಕಾನೂನುಬದ್ಧ ಹಕ್ಕು ಇಲ್ಲ, ಬಾಡಿಗೆ ಕಟ್ಟುತ್ತಿಲ್ಲ ಎಂಬುದು ವರ್ತಕರ ಸಂಘದ ವಾದ. ಹಾಗಿದ್ದರೂ, ಅವರು ಆ ಜಾಗದಲ್ಲಿ ಖರಿದಿದಾರರನ್ನು ಆಕರ್ಷಿಸುವಂತಹ  ಪ್ರಮುಖ ಸ್ಥಳವನ್ನು ಆಕ್ರಮಿಸಿದ್ದಾರೆ. ಇದರಿಂದ ಅಂಗಡಿ ಮಾಲೀಕರಿಗೆ ತೊಂದರೆಯಾಗಿದೆ ಮತ್ತು ವಾಹನವುಳ್ಳ  ಹೆಚ್ಚಿನ ಗ್ರಾಹಕರುಗಳಿಗೆ ತಮ್ಮ ಅಂಗಡಿಗಳಿಗೆ ಬರುವುದು ಸಾಧ್ಯವಾಗುವುದಿಲ್ಲ.  ಅದು ಅವರ ಮಾರಾಟ ಕಡಿಮೆಯಾಗಲು ಕಾರಣವಾಗುತ್ತದೆ ಎಂದು ಅದು ವಾದಿಸುತ್ತದೆ.<br/><br/>
    ವಾಣಿಜ್ಯ ಪ್ರದೇಶದಲ್ಲಿ ಮಾರಾಟ ಮಾಡುವುದನ್ನು ಶಾಶ್ವತವಾಗಿ ನಿಷೇಧಿಸಬೇಕು ಮತ್ತು ರಸ್ತೆಗಳ ಅಗಲೀಕರಣವಾಗಬೇಕು ಎನ್ನುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ತುರ್ತು ವಾಹನಗಳ ಸಂಚಾರಕ್ಕೆ ಅಡ್ಡಿಮಾಡುವುದರಿಂದ ಈ ಪ್ರದೇಶದಲ್ಲಿಯ ಬೀದಿ ವ್ಯಾಪಾರದಿಂದ ಸುರಕ್ಷತೆಗೆ ಅಪಾಯವಿದೆ ಎಂದು ಅಭಿವೃದ್ಧಿ ಪ್ರಾಧಿಕಾರ ವಾದಿಸುತ್ತದೆ. ಅಕ್ರಮವಾಗಿ ಜಮೀನು ವಶಪಡಿಸಿಕೊಂಡಿರುವುದರಿಂದ ನಗರದ ಆದಾಯದಲ್ಲಿ ನಷ್ಟವಾಗುತ್ತದೆ ಎಂದೂ ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ಅಭಿವೃದ್ಧಿ ಪ್ರಾಧಿಕಾರದ ರಸ್ತೆ ವಿಸ್ತರಣೆ ಮತ್ತು ಪ್ರದೇಶದಲ್ಲಿ ಬಯಲು ಮಾರುಕಟ್ಟೆಯನ್ನು ಸ್ಥಾಪಿಸಲು ಪರವಾನಗಿಗಳ ಹರಾಜು ಯೋಜನೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [t, 0, 2*t, -t],
    delta2: [-t, t, 0, t],
    delta3: [t, 0, -t, 2*t],
    delta1p:[1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1],
    delta2p:[-1, -1, 0, 1, 1, 0, 0, 0, -1, -1, -1, 0, 1, -1],
    delta3p:[-1, 0, 0, -1, -1, 0, 0, 0, -1, -1, -1, 0, -1, 0]
};

const task5 = {
    index: 5,
    text: `ಕಾರ್ಮಿಕರರಿಗೆ ಎಲ್ಲಾ ಕೌಶಲ್ಯ ಹಂತಗಳಲ್ಲಿಯೂ ಕನಿಷ್ಠ ವೇತನದ ಹೆಚ್ಚಳವನ್ನು ರಾಜ್ಯ ಸರ್ಕಾರ ಕಡ್ಡಾಯಗೊಳಿಸಿದೆ.ಈ ಹೆಚ್ಚಳದ ನಂತರ, ಗಾರ್ಮೆಂಟ್ ಫ್ಯಾಕ್ಟರಿ ಮಾಲೀಕರು ವೆಚ್ಚವನ್ನು ಕಡಿಮೆ ಮಾಡಿಕೊಳ್ಳುವ ಸಲುವಾಗಿ ಕಾರ್ಮಿಕರನ್ನು ಹೋಗಲು ಬಿಟ್ಟಿದ್ದಾರೆ, ಇದು ತಾತ್ಕಾಲಿಕ ಒಪ್ಪಂದಗಳ ಮೂಲಕ ಕಾರ್ಮಿಕರನ್ನು ಕೆಲಸದಲ್ಲಿ ಉಳಿಸಿಕೊಳ್ಳಲು ಮತ್ತು ಸಾಮೂಹಿಕವಾಗಿ ವಜಾಕ್ಕೆ ದಾರಿಯಾಗಿದೆ.. ಕಾರ್ಮಿಕರು ಬೀದಿಗಿಳಿದು ಪ್ರತಿಭಟನೆ ನಡೆಸುತ್ತಿದ್ದಾರೆ.`,
    choice1: `ಕನಿಷ್ಠ ವೇತನದಲ್ಲಿ ಪರಿಷ್ಕರಣೆಗಳನ್ನು ವಾಡಿಕೆಯಂತೆ ಮಾಡಲಾಗುತ್ತದೆ ಎಂದು ರಾಜ್ಯ ಸರ್ಕಾರ ವಾದಿಸುತ್ತದೆ. ಹೆಚ್ಚಳವು ಖಾಯಂ ಉದ್ಯೋಗಿಗಳಿಗೆ ಮಾತ್ರ ಅನ್ವಯಿಸುತ್ತದೆ ಮತ್ತು ಯಾವುದೇ ವಿವಾದಗಳು ಅಥವಾ ಆತಂಕಗಳನ್ನು ಶಾಂತಿಯುತ ಚರ್ಚೆಯ ಮೂಲಕ ಪರಿಹರಿಸಬೇಕು ಎಂದು ಅದು ಸ್ಪಷ್ಟಪಡಿಸುತ್ತದೆ.<br/><br/>
    ವೇತನ ಹೆಚ್ಚಳವನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಎತ್ತಿಹಿಡಿಯುವುದರೊಂದಿಗೆ ಪೊಲೀಸ್ ಕ್ರಮದ ಮೂಲಕ ಪ್ರತಿಭಟನೆಯನ್ನು ಕೊನೆಗೊಳಿಸುವ ಸರ್ಕಾರದ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಕಾರ್ಖಾನೆ ಮಾಲೀಕರು ಕಾರ್ಮಿಕರನ್ನು ಸಾಮೂಹಿಕವಾಗಿ ಕೆಲಸದಿಂದ ತೆಗೆದುಹಾಕುವ ಮೂಲಕ ಕಾರ್ಮಿಕ ಕಾನೂನುಗಳನ್ನು ಉಲ್ಲಂಘಿಸುತ್ತಿದ್ದಾರೆ ಎಂದು ಜಾಗತಿಕ ಫ್ಯಾಷನ್ ಬ್ರ್ಯಾಂಡ್‌ಗಳು ವಾದಿಸುತ್ತವೆ. ಅದರ ಜೊತೆಗೆ ಕಾರ್ಖಾನೆಗಳ ಜೊತೆಯ ತಮ್ಮ ಸೋರ್ಸಿಂಗ್ ಒಪ್ಪಂದಗಳ ಪ್ರಕಾರ ಇರಬೇಕಾದ ಉದ್ಯೋಗಿಗಳ ಸೌಲಭ್ಯಗಳನ್ನು ಗುತ್ತಿಗೆ ಒಪ್ಪಂದದ ಉದ್ಯೋಗ ಕಸಿದುಕೊಳ್ಳುತ್ತದೆ ಎಂದೂ ಹೇಳುತ್ತಾರೆ.<br/><br/>
    ಅಂತಹ ಎಲ್ಲಾ ಕಾರ್ಖಾನೆಗಳ ಮೇಲೆ ನಿರ್ಬಂಧಗಳನ್ನು ವಿಧಿಸಬೇಕು ಮತ್ತು ಬಾಂಗ್ಲಾದೇಶ ಮತ್ತು ಇಂಡೋನೇಷ್ಯಾದ ಪರ್ಯಾಯ ಸೋರ್ಸಿಂಗ್‌ಗೆ ಬದಲಾಯಿಸಬೇಕು ಎನ್ನುವ ಅವರ ಕರೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ದಿಢೀರ್‌ ಕ್ರಮದಿಂದ ತಮ್ಮ ಮೇಲೆ ಭಾರಿ ಆರ್ಥಿಕ ಹೊರೆ ಬಿದ್ದಿದೆ ಎಂಬುದು ಗಾರ್ಮೆಂಟ್‌ ಕಾರ್ಖಾನೆ ಮಾಲೀಕರ ವಾದ. ಉಡುಪು ರಫ್ತಿನಲ್ಲಿ ತುಂಬಾ ಕಡಿಮೆ ಮಾರ್ಜಿನ್‌ ಇರುವ ಕಾರಣ, ಕೆಲವು ಕಾರ್ಮಿಕರನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಅವರು ಗುತ್ತಿಗೆ ಒಪ್ಪಂದದ ರೀತಿ ಮಾಡಬೇಕಾಗುತ್ತದೆ. ಅವರು ತಮಗೆ ವ್ಯವಹಾರ ನಡೆಸುವ ಸ್ವಾತಂತ್ರವಿರಬೇಕು. ಅದರಲ್ಲಿ ಸರ್ಕಾರ ಹಸ್ತಕ್ಷೇಪ ಮಾಡಬಾರದು ಎಂದು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ಕೆಲವು ಕಾರ್ಮಿಕರನ್ನು ಗುತ್ತಿಗೆಯಲ್ಲಿ ಉಳಿಸಿಕೊಳ್ಳುಲು ಮತ್ತು ಮಾರುಕಟ್ಟೆ ಶಕ್ತಿಗಳ ಆಧಾರದ ಮೇಲೆ ವೇತನದ ಮೇಲಿನ ನಿಯಂತ್ರಣವನ್ನು ತೆಗೆಯಲು ಒತ್ತಾಯಿಸುತ್ತಿರುವ ಕಾರ್ಖಾನೆಯ ಮಾಲೀಕರನ್ನು ಬೆಂಬಲಿಸಿ`,
    delta1: [t, -t, -t, t],
    delta2: [-2*t, t, t, 2*t],
    delta3: [t, 2*t, -t, -t],
    delta1p:[1, 1, -1, -1, -1, -1, 0, 0, 1, 0, 1, 0, -1, 1],
    delta2p:[1, -1, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, -1, -1],
    delta3p:[0, 1, -1, 1, 1, 0, 0, 0, 0, -1, -1, 0, 1, 0]
};

const task6 = {
    index: 6,
    text: `ಟಿವಿ ಸುದ್ದಿ ವಾಹಿನಿಯೊಂದು ಇತ್ತೀಚೆಗೆ ಹಿರಿಯ ಸರ್ಕಾರಿ ಅಧಿಕಾರಿಯೊಬ್ಬರ ಮೇಲೆ 'ಸ್ಟಿಂಗ್ ಆಪರೇಷನ್' ನಡೆಸಿತ್ತು. ತೆರಿಗೆದಾರರ ಹಣಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಹಣಕಾಸಿನ ಹಗರಣದಲ್ಲಿ ಅವರ ಪಾತ್ರವನ್ನು ವರದಿಯು ಬಹಿರಂಗಪಡಿಸಿತು, ಅದರ ಪರಿಣಾಮವಾಗಿ ನಂತರ ಅವರನ್ನು ಸೇವೆಯಿಂದ ವಜಾಗೊಳಿಸಲಾಯಿತು. ಸಚಿವಾಲಯದಲ್ಲಿಯ ಇತರ ಅಧಿಕಾರಿಗಳ ವಂಚನೆ ಪ್ರಕರಣಗಳ ತನಿಖೆ ಮಾಡಲು ಆಯೋಗವನ್ನು ಸ್ಥಾಪಿಸಲಾಗಿದೆ. ಅದರ ನಂತರ, ಅಧಿಕಾರಿ ಮತ್ತು ಆಕೆಯ ಪತಿ ಅವರ ಮನೆಯಲ್ಲಿಯ ಸಂಧಾನ ಮಾಡಿಕೊಳ್ಳುವ ಚಿತ್ರಗಳು ವಿವಿಧ ಆನ್‌ಲೈನ್ ಮಾಧ್ಯಮಗಳ ಮೂಲಕ ಸೋರಿಕೆಯಾದವು. ಗೌಪ್ಯತೆ ಉಲ್ಲಂಘನೆಗಳು ಅಸಂವಿಧಾನಿಕ ಎಂದು ತಿಳಿಸಿದ MIB ಚಾನೆಲ್‌ನ ಪರವಾನಗಿಯನ್ನು ರದ್ದುಗೊಳಿಸುವಂತೆ ಆದೇಶಿಸಿದೆ.`,
    choice1: `ಟಿವಿ ಸುದ್ದಿ ವಾಹಿನಿಯು ಕಥೆಯನ್ನು ವರದಿ ಮಾಡುವಾಗ ಪತ್ರಕರ್ತರು ಬಳಸಿದ ವಿಧಾನಗಳ ಬಗ್ಗೆ ತಿಳಿದಿರಲಿಲ್ಲ ಎಂದು ವಾದಿಸುತ್ತದೆ. ಪತ್ರಕರ್ತರು ಶಿಸ್ತು ಕ್ರಮವನ್ನು ಎದುರಿಸಬೇಕು ಆದರೆ ಚಾನೆಲ್ ಅನ್ನು ಪ್ರಸಾರ ಮಾಡದಂತೆ ತದೆಯಬಾರದು, ಏಕೆಂದರೆ ಅದು ಪತ್ರಿಕಾ ಸ್ವಾತಂತ್ರ್ಯದ ದೊಡ್ಡ ಉಲ್ಲಂಘನೆಯಾಗುತ್ತದೆ ಎಂದು ಅದು ಹೇಳುತ್ತದೆ. ಕೇಂದ್ರ ಸಚಿವಾಲಯದಲ್ಲಿನ ಭ್ರಷ್ಟಾಚಾರದ ವರದಿಗಳ ಪ್ರಸಾರವಾದ ನಂತರವೇ ಸರ್ಕಾರ ಅವರ ವಿರುದ್ಧ ಕ್ರಮಕೈಗೊಳ್ಳುತ್ತಿದೆ ಎಂದು ಅದು ಸೇರಿಸುತ್ತದೆ.<br/><br/>
    ಪರವಾನಗಿಯ ಮರುಸ್ಥಾಪನೆ ಹಾಗೂ ಕಥೆಯ ಪ್ರಸಾರದ ಮುಂದುವರಿಕೆಯ ಅನುಮತಿಯ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಪತ್ರಕರ್ತರ ಖಾಸಗಿತನ/ಪ್ರೈವೆಸಿ ಉಲ್ಲಂಘನೆಯಿಂದ ಚಾನೆಲ್ ಲಾಭ ಪಡೆದಿದೆ, ಹಾಗಾಗಿ ಅದರ ಮೇಲೆ ಪ್ರತಿಬಂಧ ಹೇರಬೇಕು ಎನ್ನುವುದು ಕೇಂದ್ರದ ವಾದ. ಭ್ರಷ್ಟಾಚಾರವನ್ನು ಬೇರು ಸಮೇತ ಕಿತ್ತೊಗೆಯಲು ಬದ್ಧ ಎಂದು ಹೇಳಿರುವ ಅದು, ಅದಕ್ಕಾಗಿ ಒಂದು ಆಯೋಗವನ್ನು ರಚಿಸಲಾಗಿದೆಎಂದು ಹೇಳಿದೆ.<br/><br/>
    ಯಾವುದೇ ನ್ಯಾಯಾಂಗ ಪ್ರಕ್ರಿಯೆಗಳಿಗೆ ಒಳಪಟ್ಟಂತೆ ಚಾನಲ್‌ನ ಪರವಾನಗಿಯನ್ನು ಶಾಶ್ವತವಾಗಿ ಹಿಂತೆಗೆದುಕೊಳ್ಳುವ  ಹಾಗೂ ಕಥೆಯ ಮುಂದಿನ ಪ್ರಕಟಣೆಯನ್ನು ನಿಷೇಧಿಸುವ ಅವರ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಪತ್ರಕರ್ತರಿಗೆ ಅಧಿಕಾರಿಯ ಸಮೀಪ ಹೋಗಲು ಅವರಿಗೆ ಬೇರೆ ಆಯ್ಕೆಗಳಿರಲಿಲ್ಲ ಎಂದು ಸಾಮಾಜಿಕ ಮಾಧ್ಯಮದಲ್ಲಿನ ವೀಕ್ಷಕರು ವಾದಿಸುತ್ತಾರೆ. ಸರ್ಕಾರದ ಕಾರ್ಯಚಟುವಟಿಕೆಗಳು ಮತ್ತು ಅದರೊಳಗಿನ ಯಾವುದೇ ಭ್ರಷ್ಟಾಚಾರದ ಮಾಹಿತಿಯನ್ನು ಪಡೆಯುವ ಹಕ್ಕನ್ನು ಅವರು ಹೊಂದಿದ್ದಾರೆ ಎಂದು ಅವರು ಹೇಳುತ್ತಾರೆ.<br/><br/>
    ಚಾನೆಲ್‌ನ ಪರವಾನಗಿಯನ್ನು ಮರುಸ್ಥಾಪಿಸುವ ಮತ್ತು ಪತ್ರಕರ್ತರನ್ನು ಮುಕ್ತಗೊಳಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [0, t, t, -t],
    delta2: [0, 0, -t, t],
    delta3: [0, 2*t, t, -2*t],
    delta1p:[0, 0, 1, 0, 0, 0, 0, 0, -1, 0, 0, 0, -1, 0],
    delta2p:[0, 0, -1, -1, -1, 0, 0, 0, 0, -1, 0, 0, -1, 0],
    delta3p:[0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, -1]
};

const task7 = {
    index: 7,
    text: `ಉತ್ತರ ಭಾರತದಾದ್ಯಂತ ಕಳಪೆ ಗಾಳಿಯ ಗುಣಮಟ್ಟ ಕಳಪೆ ಇರುವ ಕಾರಣದಿಂದಾಗಿ, ಸಾಮಾನ್ಯವಾಗಿ ಪಟಾಕಿ ಸಿಡಿಸಿ ಆಚರಿಸಲಾಗುವ ಧಾರ್ಮಿಕ ಹಬ್ಬವಾದ ದೀಪಾವಳಿಗೆ ಮುಂಚಿತವಾಗಿ ಸುಪ್ರೀಂ ಕೋರ್ಟ್ ಎಲ್ಲಾ ಪಟಾಕಿಗಳ ಮೇಲೆ ದೇಶದಾದ್ಯಂತ ನಿಷೇಧವನ್ನು ವಿಧಿಸಿದೆ.ಈ ಕ್ರಮವನ್ನು ಜಾರಿಗೆ ತರಲು ಸರ್ಕಾರ ಹಿಂದೇಟು ಹಾಕುತ್ತಿರುವುದರಿಂದ ವಿವಿಧ ರಾಜ್ಯಗಳಲ್ಲಿ ಅನೇಕ ಪ್ರತಿಭಟನೆಗಳನ್ನು ನಡೆಸಲಾಗುತ್ತಿದೆ.`,
    choice1: `ಇಂತಹ ಕ್ರಮವು ಪಟಾಕಿಗಳ ಪ್ರಮುಖ ತಯಾರಕರಾದ ಸಣ್ಣ ಮತ್ತು ಮಧ್ಯಮ ವ್ಯವಹಾರಗಳ ಮೇಲೆ ಹೆಚ್ಚು ಪರಿಣಾಮ ಬೀರುತ್ತದೆ ಎಂದು ಕೇಂದ್ರವು ವಾದಿಸುತ್ತದೆ. ಈ ಒಂದು ಸಾರಾಸಗಟಾದ ನಿಷೇಧದಿಂದ ಅವರು ತಮ್ಮ ಜೀವನೋಪಾಯವನ್ನು ಕಳೆದುಕೊಳ್ಳುತ್ತಾರೆ.<br/><br/>
    ಸುಪ್ರೀಂ ಕೋರ್ಟ್ ಆದೇಶವನ್ನು ಜಾರಿಗೊಳಿಸದೆ ನಿರ್ಲಕ್ಷಿಸುವ ಅವರ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಈ ಕ್ರಮವು ಧಾರ್ಮಿಕ ಸ್ವಾತಂತ್ರ್ಯದ ಹಕ್ಕನ್ನು ಉಲ್ಲಂಘಿಸುತ್ತದೆ ಎಂದು ಪ್ರತಿಭಟನಾಕಾರರ ಗುಂಪುಗಳು ವಾದಿಸುತ್ತವೆ, ಏಕೆಂದರೆ ಇದು ಅವರ ಧಾರ್ಮಿಕ ಪದ್ಧತಿಗಳನ್ನು ಮುಕ್ತವಾಗಿ ಆಚರಿಸಲು ಅನುಮತಿಸುವುದಿಲ್ಲ. ದೀಪಾವಳಿಗೆ ಪಟಾಕಿಯನ್ನು ನಿಷೇಧಿಸಬೇಕಾದರೆ, ಇತರ ಧರ್ಮಗಳು ಆಚರಿಸುವ ಹಬ್ಬಗಳಲ್ಲಿ ಧಾರ್ಮಿಕ ಆಚರಣೆಗಳನ್ನು ಸಹ ನಿಷೇಧಿಸಬೇಕು ಎಂದು ಅವರು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ಈದ್‌ನ ಸಮಯದಲ್ಲಿ ಪ್ರಾಣಿ ಬಲಿ ಮತ್ತು ಮಾಸ್ ಆಚರಣೆಯಲ್ಲಿ ವೈನ್ ನ ಬಳಕೆಗಳ ಆಚರಣೆಯ ಮೇಲೂ ಸರ್ಕಾರ  ಧಾರ್ಮಿಕ ನಿಷೇಧವನ್ನು ವಿಸ್ತರಿಸಬೇಕು ಎನ್ನುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಜನರು ಗಂಭೀರ ಕಾಯಿಲೆಗೆ ಗುರಿಯಾಗುವುದನ್ನು ತಡೆಯಲು ಏಕ ಮಾತ್ರ ಆಯ್ಕೆಯೆಂದರೆ ಸಾರಾಸಗಟಾದ ನಿಷೇಧ ಎಂದು ಪರಿಸರವಾದಿಗಳು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ನಿಷೇಧವನ್ನು ಜಾರಿಗೊಳಿಸುವ ಮತ್ತು ಅದನ್ನು ವರ್ಷಪೂರ್ತಿ ಅನ್ವಯಿಸುವಂತೆ ವಿಸ್ತರಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ`,
    delta1: [t, t, -2*t, 0],
    delta2: [-t, 2*t, -2*t, t],
    delta3: [-t, -t, t, -t],
    delta1p:[0, 1, -1, 0, 0, 0, 0, 0, 1, 0, 0, 0, -1, 0],
    delta2p:[-1, -1, 0, 1, 1, 0, -1, -1, -1, 0, 0, -1, 1, -1],
    delta3p:[-1, -1, 1, 1, 1, 0, 0, -1, -1, 0, 0, 0, 0, -1]
};

const task8 = {
    index: 8,
    text: `ಒಂದು ರಾಜ್ಯ ಸರ್ಕಾರವು ವರ್ಕಿಂಗ್ ಹಾಲಿಡೇ ಝೋನ್‌ಗಳನ್ನು ರಚಿಸಿದೆ, ಇದರಲ್ಲಿ ಎಲ್ಲಾ ಉತ್ಪಾದನಾ ಸಂಸ್ಥೆಗಳು ಮೂರು ವರ್ಷಗಳ ಅವಧಿಗೆ ವೇತನ-ಸಂಬಂಧಿತ ಕಾನೂನುಗಳನ್ನು ಅನುಷ್ಠಾನಗೊಳಿಸುವುದರಿಂದ ವಿನಾಯಿತಿ ನೀಡಲಾಗುತ್ತದೆ. ಅವರು ಲೈಂಗಿಕ ಕಿರುಕುಳ ಮತ್ತು ವೇತನೇತರ ಪ್ರಯೋಜನಗಳಿಗೆ ಸಂಬಂಧಿಸಿದ ಇತರ ಕುಂದುಕೊರತೆಗಳ ದೂರುಗಳನ್ನು ಎದುರಿಸಲು ಸಮಿತಿಗಳನ್ನು ರಚಿಸಬೇಕಾಗುತ್ತದೆ. ಈ ಕ್ರಮಕ್ಕೆ ಪ್ರತಿಯಾಗಿ ರಾಜ್ಯಾದ್ಯಂತ ಕಾರ್ಮಿಕರು ಮುಷ್ಕರ ನಡೆಸುತ್ತಿದ್ದಾರೆ.`,
    choice1: `ಇದು ರಾಜ್ಯದಲ್ಲಿ ತಯಾರಿಕಾ ಉತ್ಪಾದನೆಯನ್ನು ಸುಧಾರಿಸುತ್ತದೆ ಮತ್ತು ವಿದ್ಯಾವಂತ ಯುವಕರ ಉದ್ಯೋಗದ ಪ್ರಮಾಣವನ್ನು ಬಹುಪಟ್ಟು ಹೆಚ್ಚಿಸುತ್ತದೆ ಎಂದು ರಾಜ್ಯ ಸರ್ಕಾರ ವಾದಿಸುತ್ತದೆ. ಉತ್ಪಾದನಾ ಘಟಕಗಳ ಕೇಂದ್ರೀಕರಣವು ಕೈಗಾರಿಕಾ ತ್ಯಾಜ್ಯ ಮತ್ತು ಪರಿಸರ ಹಾನಿಯನ್ನು ನಿರ್ವಹಿಸುವುದನ್ನು ಸುಲಭಗೊಳಿಸುತ್ತದೆ.<br/><br/>
    ವರ್ಕಿಂಗ್ ಹಾಲಿಡೇ ಝೋನ್‌ಗಳಲ್ಲಿ ಘಟಕಗಳನ್ನು ಸ್ಥಾಪಿಸಲು ಕಂಪನಿಗಳನ್ನು ಆಹ್ವಾನಿಸುತ್ತಿರುವ ಅವರ ನಡೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಈ ಕ್ರಮವು ಆರ್ಥಿಕ ಉತ್ಪಾದಕತೆಯನ್ನು ಅಗಾಧವಾಗಿ ಸುಧಾರಿಸುತ್ತದೆ ಮತ್ತು ರಾಜ್ಯ ರಫ್ತು ಕೇಂದ್ರವಾಗುವುದಕ್ಕೆ ಅನುವು ಮಾಡಿಕೊಡುತ್ತದೆ ಎಂದು ಆರ್ಥಿಕ ವಿಶ್ಲೇಷಕರು ಮತ್ತು ತಜ್ಞರು ವಾದಿಸುತ್ತಾರೆ. ಸಂಪೂರ್ಣ ಕಾರ್ಮಿಕ ಮಾರುಕಟ್ಟೆಯನ್ನು ಕಟ್ಟುಪಾಡು ಇಲ್ಲದಂತೆ ಮಾಡುವುದರಿಂದ ಕಾರ್ಮಿಕರ ಸ್ಪರ್ಧಾತ್ಮಕತೆ ಮತ್ತಷ್ಟು ಹೆಚ್ಚಾಗುತ್ತದೆ.<br/><br/>
    ವರ್ಕಿಂಗ್ ಹಾಲಿಡೇ ಝೋನ್‌ಗಳ ಅವರ ಪ್ರೋತ್ಸಾಹವನ್ನು ಬೆಂಬಲಿಸಿ ಮತ್ತು ಎಲ್ಲಾ ಕಾರ್ಮಿಕ ಕಾನೂನುಗಳಿಗೆ ವಿನಾಯಿತಿಯನ್ನು ವಿಸ್ತರಿಸುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಈ ಕ್ರಮವು ಕೂಲಿ ದರವನ್ನು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ಕಡಿಮೆ ಮಾಡುತ್ತದೆ ಮತ್ತು ಸಾವಿರಾರು ಜನರಿಗೆ ಜೀವನಾಂಶವನ್ನು ನಿರಾಕರಿಸುತ್ತದೆ ಎಂದು ಕಾರ್ಮಿಕ ಸಂಘಟನೆಗಳು ವಾದಿಸುತ್ತವೆ. ಇದರಿಂದ ಅವರು ವೇತನ ದರಗಳು ಮತ್ತು ಇತರ ಎಲ್ಲಾ ವಿವಾದ ಪರಿಹಾರ ಕಾರ್ಯವಿಧಾನಗಳ ಮೇಲೆ ಅಧಿಕಾರವನ್ನು ಹೊಂದಿರುವ ಉತ್ಪಾದಕರ ವಿರುದ್ಧ ಕಾರ್ಮಿಕರ ಮೇಲೆ ಅಸಮಾನವಾಗಿ ಪರಿಣಾಮ ಬೀರುತ್ತದೆ.<br/><br/>
    ಎಲ್ಲಾ ವರ್ಕಿಂಗ್ ಹಾಲಿಡೇ  ವಲಯಗಳನ್ನು ವಿಸರ್ಜಿಸಲು ಮತ್ತು ಎಲ್ಲಾ ಕಾರ್ಮಿಕರಿಗೆ ವೇತನ ಕಾನೂನುಗಳ ಅನ್ವಯವನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    delta1: [t, t, -t, t],
    delta2: [2*t, 0, -2*t, t],
    delta3: [0, t, t, -t],
    delta1p:[-1, -1, 1, 0, 0, 0, 0, 0, -1, -1, -1, 0, 0, -1],
    delta2p:[-1, -1, 0, 0, 0, 0, 0, 0, -1, -1, -1, 0, -1, -1],
    delta3p:[1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0]
};

const task9 = {
    index: 9,
    text: `ಸರ್ಕಾರದ ಆದೇಶದಂತೆ 50 ಕ್ಕಿಂತ ಕಡಿಮೆ ವಿಶೇಷ ವರದಿಗಾರರನ್ನು ಹೊಂದಿರುವ ಎಲ್ಲಾ ಸುದ್ದಿ ಮಾಧ್ಯಮಗಳು ತಮ್ಮ ವಿಷಯವನ್ನು ಪ್ರಕಟಣೆ ಮಾಡುವ ಮೊದಲು ಮಾಹಿತಿ ಮತ್ತು ಪ್ರಸಾರ ಸಚಿವಾಲಯದಿಂದ ಪರಿಶೀಲಿನೆ ಮಾಡಿಸುವ ಅಗತ್ಯವಿದೆ. ಅದನ್ನು ಪಾಲಿಸದಿರುವವರು ವೈಯಕ್ತಿಕ ಹೊಣೆಗಾರಿಕೆ ಸೇರಿದಂತೆ ಕಾನೂನು ಕ್ರಮವನ್ನು ಎದುರಿಸಬೇಕಾಗುತ್ತದೆ. ಈ ಕ್ರಮವು ಪತ್ರಿಕಾ ಸ್ವಾತಂತ್ರ್ಯಕ್ಕೆ ಅಡ್ಡಿಪಡಿಸುತ್ತದೆ ಮತ್ತು ಸಂಪೂರ್ಣವಾಗಿ ಪ್ರಕಟಣೆಯನ್ನು  ನಿಲ್ಲಿಸುವ ಅಪಾಯ ತರುತ್ತದೆ ಎಂದು ಪತ್ರಕರ್ತರ ಮತ್ತು ಮಾಧ್ಯಮ ಸಂಸ್ಥೆಗಳ ವಾದವಾಗಿದೆ,`,
    choice1: `ಕೆಲವೇ ಕೆಲವು ವರದಿಗಾರರನ್ನು ಹೊಂದಿರುವ ಔಟ್‌ಲೆಟ್‌ಗಳಿಗೆ ಆ ನೆಲಗಟ್ಟಿನಲ್ಲಿ ಉಪಸ್ಥಿತಿ ಇಲ್ಲ ಹಾಗಾಗಿ  ಉದ್ದೇಶಪೂರ್ವಕವಾಗಿ ಅಥವಾ ಬೇರೆ ರೀತಿಯಲ್ಲಿ ತಪ್ಪು ಮಾಹಿತಿಯನ್ನು ಹರಡುವುದಕ್ಕೆ ಅದು ಕಾರಣವಾಗಬಹುದು ಎಂದು ಕೇಂದ್ರ ಸರ್ಕಾರ ವಾದಿಸುತ್ತದೆ. ಪರಿಶೀಲನೆ ಪ್ರಕ್ರಿಯೆಯು ಅವರಿಗೆ ವಿಶ್ವಾಸಾರ್ಹತೆಯನ್ನು ಪಡೆಯಲು ಮತ್ತು ಭವಿಷ್ಯದ ಬೆಳವಣಿಗೆಗೆ ಮಾರ್ಗದರ್ಶನ ನೀಡಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.<br/><br/>
    ಆದೇಶವನ್ನು ಈಗಿನಿಂದಲೇ ಜಾರಿಗೊಳಿಸಲು ಮತ್ತು ಅನುಸರಣೆ ಮಾಡದ ಸಂಸ್ಥೆಗಳ ಮೇಲೆ ದಂಡವನ್ನು ವಿಧಿಸಲು ಅವರ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ಪತ್ರಿಕಾ ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಖಾತ್ರಿಪಡಿಸುವ ಸಲುವಾಗಿ, ಸರ್ಕಾರದ ಪರಿಶೀಲನೆ ಇರಬಾರದು ಎಂದು ಪ್ರತಿಪಕ್ಷಗಳು ವಾದಿಸುತ್ತವೆ. ಬದಲಿಗೆ, ವರದಿಗಾರರನ್ನು UPSC ಮೂಲಕ ಸರ್ಕಾರವು ನೇಮಿಸಿಕೊಳ್ಳಬೇಕು ಮತ್ತು ಸಮರ್ಪಕವಾಗಿ ಆನ್-ಗ್ರೌಂಡ್ ವರದಿಯನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ವಿವಿಧ ಮಾಧ್ಯಮ ಸಂಸ್ಥೆಗಳಿಗೆ ನಿಯೋಜಿಸಬೇಕು.<br/><br/>
    ಆದೇಶವನ್ನು ಹಿಂಪಡೆಯಲು ಮತ್ತು ವರದಿಗಾರರಿಗೆ ನಾಗರಿಕ ಸೇವೆಯನ್ನು ಸ್ಥಾಪಿಸಲು ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ`,
    choice3: `ಈ ಆದೇಶವು ಉದ್ಯೋಗಾವಕಾಶಗಳನ್ನು ಪ್ರವೇಶಿಸುವ ಅವರ ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಉಲ್ಲಂಘಿಸುತ್ತದೆ ಎಂದು ವರದಿಗಾರರು ವಾದಿಸುತ್ತಾರೆ. ಈ ಆದೇಶದ ನಂತರ, ಅವರು ಕೇವಲ ಒಂದು ಮಾಧ್ಯಮದ  ಔಟ್ಲೆಟ್ನೊಂದಿಗೆ ಮಾತ್ರ  ಕೆಲಸ ಮಾಡಬೇಕಾಗುತ್ತದೆ. ಇದು ಅವರ ವರದಿಗಾರಿಕೆಯ ಮೇಲೆ ಸಂಪಾದಕೀಯ ನಿರ್ಬಂಧಗಳನ್ನು ಹೇರುತ್ತದೆ, ಪತ್ರಿಕಾ ಸ್ವಾತಂತ್ರ್ಯಕ್ಕೆ ಅಡ್ಡಿಯಾಗುತ್ತದೆ.<br/><br/>
    ಆದೇಶವನ್ನು ಹಿಂತೆಗೆದುಕೊಳ್ಳಲು ಅವರ ಕರೆಯನ್ನು ಬೆಂಬಲಿಸಿ ಮತ್ತು ಸ್ವತಂತ್ರ ವರದಿಯನ್ನು ಅನುಮತಿಸುವುದನ್ನು ಮುಂದುವರಿಸಿ.`,
    delta1: [-t, t, -t, t],
    delta2: [-t, t, 0, t],
    delta3: [t, -t, 0, -t],
    delta1p:[0, 0, -1, -1, -1, 0, 0, 0, 0, 1, 1, 0, -1, 0],
    delta2p:[0, -1, -1, -1, -1, 0, 0, 0, 1, 1, 1, 0, -1, 0],
    delta3p:[1, 0, 1, 1, 1, 0, 0, 0, 0, -1, -1, 0, 0, 0]
};

const task10 = {
    index: 10,
    text: ` ಅಂತರ್ ಧರ್ಮೀಯ ಮತಾಂತರವನ್ನು ನಿಷೇಧಿಸುವ ಸಂವಿಧಾನ ತಿದ್ದುಪಡಿ ಮಸೂದೆಯನ್ನು ಆಡಳಿತ ಪಕ್ಷದ ನಾಯಕರು ಸಂಸತ್ತಿನಲ್ಲಿ ಮಂಡಿಸಿದ್ದಾರೆ. ಇತ್ತೀಚಿಗೆ, ಪತ್ರಿಕೆಗಳು ಬಹುಸಂಖ್ಯಾತ ಧರ್ಮಕ್ಕೆ ಸೇರಿದವರ ಮತಾಂತರಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಹಲವಾರು ಘಟನೆಗಳನ್ನು ವರದಿ ಮಾಡಿವೆ.`,
    choice1: `ಈ ಮಸೂದೆಯು ಪ್ರತಿಯೊಬ್ಬ ವ್ಯಕ್ತಿಯ ಧಾರ್ಮಿಕ ನಂಬಿಕೆಗಳ ಹಕ್ಕನ್ನು ರಕ್ಷಿಸುವ ಉದ್ದೇಶ ಹೊಂದಿದೆ ಎಂದು ಆಡಳಿತ ಪಕ್ಷದ ಸದಸ್ಯರು ವಾದಿಸುತ್ತಾರೆ. ಯಾವುದೇ ಆಕ್ರಮಣಕಾರಿ ಧರ್ಮ ಪ್ರಚಾರವನ್ನು ರಾಜ್ಯ ಸಹಿಸುವುದಿಲ್ಲ ಎಂಬ ಸಂದೇಶವನ್ನು ರವಾನಿಸುವುದು ಅವಶ್ಯಕ.<br/><br/>
    ಮಸೂದೆಯನ್ನು ಅಂಗೀಕರಿಸುವ ಮತ್ತು ಸಂವಿಧಾನದ ಅಡಿಯಲ್ಲಿ ಮೂಲಭೂತ ಹಕ್ಕುಗಳನ್ನು ತಿದ್ದುಪಡಿ ಮಾಡುವ ಅವರ ನಡೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice2:`ರಾಷ್ಟ್ರದ ಏಕತೆ ಮತ್ತು ಸಮಗ್ರತೆಯನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ಮಸೂದೆ ನಿರ್ಣಾಯಕವಾಗಿದೆ ಎಂದು ಕೇಂದ್ರ ಸರ್ಕಾರ ವಾದಿಸುತ್ತದೆ. ಅದರ ಅನುಪಸ್ಥಿತಿಯಲ್ಲಿ, ದೊಡ್ಡ ಪ್ರಮಾಣದ ಧಾರ್ಮಿಕ ಮತಾಂತರಗಳು ದೇಶದ ಸಾಮಾಜಿಕ ರಚನೆಯನ್ನು ಹಾನಿಗೊಳಿಸಬಹುದು.<br/><br/>
    ಹೊಸ ತಿದ್ದುಪಡಿಯ ಅಡಿಯಲ್ಲಿ ಕಾನೂನನ್ನು ಜಾರಿಗೆ ತಂದ ತಕ್ಷಣ ಅದನ್ನು ಜಾರಿಗೊಳಿಸುವ ಅವರ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ ಮತ್ತು ತಕ್ಷಣವೇ ಜಾರಿಗೆ ಬರುವಂತೆ ಎಲ್ಲಾ ಅಪರಾಧಿಗಳ ವಿರುದ್ಧ ಕಾನೂನು ಕ್ರಮ ಜರುಗಿಸಿ.`,
    choice3: `ರಾಷ್ಟ್ರೀಯ ಅಲ್ಪಸಂಖ್ಯಾತರ ಆಯೋಗವು ಮಸೂದೆಯ ವ್ಯಾಪ್ತಿಯು ತುಂಬಾ ವಿಸ್ತಾರವಾಗಿದೆ ಮತ್ತು ಸ್ವಯಂಪ್ರೇರಿತ ಮತಾಂತರಗಳನ್ನು ಸಹ ನಿಷೇಧಿಸುತ್ತದೆ ಎಂದು ವಾದಿಸುತ್ತದೆ. ಪ್ರತಿಯೊಬ್ಬ ವ್ಯಕ್ತಿಯು ತಮ್ಮ ಮೂಲಭೂತ ಧಾರ್ಮಿಕ ಸ್ವಾತಂತ್ರ್ಯದ ಭಾಗವಾಗಿ ಮತಾಂತರಗೊಳ್ಳುವ ಹಕ್ಕನ್ನು ಹೊಂದಿರಬೇಕು ಎಂದು ಅದು ಸೇರಿಸುತ್ತದೆ.<br/><br/>
    ಮಸೂದೆಯನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ವಿರೋಧಿಸುವ ಅವರ ನಡೆಯನ್ನು ಬೆಂಬಲಿಸಿ ಮತ್ತು ಭವಿಷ್ಯದಲ್ಲಿ ಮೂಲಭೂತ ಹಕ್ಕುಗಳಿಗೆ ಯಾವುದೇ ತಿದ್ದುಪಡಿ ತರುವುದನ್ನು ನಿಷೇಧಿಸಲು ಸುಪ್ರೀಂ ಕೋರ್ಟ್‌ಗೆ ಮನವಿ ಮಾಡಿ.`,
    delta1: [0, t, -t, t],
    delta2: [0, t, -t, 2*t],
    delta3: [0, -t, t, -t],
    delta1p:[-1, 0, 1, -1, -1, 1, -1, 1, 0, 0, 0, -1, 1, -1],
    delta2p:[-1, 0, -1, -1, 1, -1, -1, -1, -1, 0, 0, -1, 0, -1],
    delta3p:[1, 0, 1, 1, 1, -1, 1, -1, 0, -1, 0, 1, -1, 0]
};

const task11 = {
    index: 11,
    text: `ಕೇಂದ್ರ ಸರ್ಕಾರವು ಮುಂಬರುವ ಎಲ್ಲಾ ಸಾರ್ವಜನಿಕ ಮತ್ತು ಖಾಸಗಿ ಸಂಸ್ಥೆಗಳಲ್ಲಿ ನಪುಂಸಕ ಲಿಂಗಿಗಳ ಸ್ನಾನಗೃಹಗಳನ್ನು ಕಡ್ಡಾಯಗೊಳಿಸಿ ರಾಷ್ಟ್ರೀಯ ಕಟ್ಟಡ ಸಂಹಿತೆಗೆ ತಿದ್ದುಪಡಿ ತಂದಿದೆ. ಈ ಆದೇಶವನ್ನು ತಕ್ಷಣದಿಂದಲೇ ಕಟ್ಟಡದ ಅನುಮತಿಗಳನ್ನು ನೀಡುವಾಗ ಜಾರಿಗೆ ಬರುವಂತೆ ಅಳವಡಿಸಿಕೊಳ್ಳಲು ಎಲ್ಲಾ ಮಹಾನಗರ ಅಭಿವೃದ್ಧಿ ಅಧಿಕಾರಿಗಳಿಗೆ ಸೂಚನೆ ನೀಡಿದೆ.`,
    choice1: `ಮುಂಬರುವ ಎಲ್ಲಾ ಮೂಲಸೌಕರ್ಯಗಳಲ್ಲಿ ಒಳಗೊಳ್ಳುವಿಕೆ ಇರುವಂತೆ ನಿರ್ಮಿಸುವ ತುರ್ತು ಅವಶ್ಯಕತೆಯಿದೆ ಎಂದು ಕೇಂದ್ರವು ವಾದಿಸುತ್ತದೆ. ಎಲ್ಲಾ ಲಿಂಗದವರಿಗೂ ಸಮನಾದ ನ್ಯಾಯ ಒದಗಿಸುವ ಸಾಮಾಜಿಕ ಪ್ರಯೋಜನಗಳನ್ನು ಜಾರಿಗೆ ತರಲು ಹೆಚ್ಚುವರಿ ಆರ್ಥಿಕ ವೆಚ್ಚಗಳು ಅಗತ್ಯವೆಂದು ಅದು ಹೇಳುತ್ತದೆ.<br/><br/>
    ಎಲ್ಲಾ ಭವಿಷ್ಯದ ನಿರ್ಮಾಣಗಳು  ಲಿಂಗ ತಟಸ್ಥ ಸ್ನಾನಗೃಹಗಳನ್ನು ಹೊಂದಿರಬೇಕೆಂದು ಕಡ್ಡಾಯಗೊಳಿಸುವ ಸರ್ಕಾರದ ಕ್ರಮವನ್ನು ಬೆಂಬಲಿಸಿ`,
    choice2:`ಕಟ್ಟಡ ಸಂಹಿತೆಯ ಅಡಿಯಲ್ಲಿ ಸರ್ಕಾರವು ತಾಂತ್ರಿಕವಲ್ಲದ ಅವಶ್ಯಕತೆಗಳನ್ನು ಕಡ್ಡಾಯಗೊಳಿಸಲು ಸಾಧ್ಯವಿಲ್ಲ ಎಂದು ಖಾಸಗಿ ವಸತಿ ಬಿಲ್ಡರ್‌ಗಳು ವಾದಿಸುತ್ತಾರೆ. ಇದಲ್ಲದೆ, ಭೂಮಿ ಮತ್ತು ನಿರ್ಮಾಣದ ಹೆಚ್ಚುವರಿ ಹಣಕಾಸಿನ ವೆಚ್ಚಗಳು ಕಡಿಮೆ-ವೆಚ್ಚದ ವಸತಿಗಳ ನಿರ್ಮಾಣ ಅಸಾಧ್ಯವಾತ್ತದೆ.<br/><br/>
    ಈ ತಿದ್ದುಪಡಿಯನ್ನು ರೋಲ್-ಬ್ಯಾಕ್ ಮಾಡಲು ಅಥವಾ ಹೆಚ್ಚುವರಿ ವೆಚ್ಚಗಳಿಗೆ ಸಮಾನವಾದ ನಗದು ಸಬ್ಸಿಡಿಗಳನ್ನು ಒದಗಿಸಲು ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ.`,
    choice3: `ಪ್ರಭಾವಿ ಸ್ತ್ರೀವಾದಿ ಕಾರ್ಯಕರ್ತರು ಮತ್ತು ಶಿಕ್ಷಣ ತಜ್ಞರು ಲಿಂಗ ತಟಸ್ಥ ಸ್ನಾನಗೃಹಗಳನ್ನು ಕಡ್ಡಾಯಗೊಳಿಸುವುದರಿಂದ ಮಹಿಳೆಯರ ವಿರುದ್ಧ ಲೈಂಗಿಕ ದೌರ್ಜನ್ಯದ ಹೆಚ್ಚಳಕ್ಕೆ ಕಾರಣವಾಗಬಹುದು ಎಂದು ವಾದಿಸುತ್ತಾರೆ. ಅಂತಹ ನೀತಿ ಪ್ರಸ್ತಾಪವನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುವ ಮೊದಲು ಯಾವುದೇ ಸಮಾಲೋಚನೆಗಳಿಲ್ಲ ಎಂದು ಅವರು ವಾದಿಸುತ್ತಾರೆ.<br/><br/>
    ಈ ತಿದ್ದುಪಡಿಯನ್ನು ಹಿಂತೆಗೆದುಕೊಳ್ಳುವ ಅವರ ಬೇಡಿಕೆಯನ್ನು ಬೆಂಬಲಿಸಿ ಮತ್ತು ಒಳಗೊಳ್ಳುವಿಕೆಗಾಗಿ ನೀತಿ ಕ್ರಮಗಳ ಕುರಿತು ಅವರೊಂದಿಗೆ ಮತ್ತು LGBTQI+ ಸಮುದಾಯದೊಂದಿಗೆ ಸಾರ್ವಜನಿಕ ಸಮಾಲೋಚನೆಗಳನ್ನು ಪ್ರಾರಂಭಿಸಿ.`,
    delta1: [-t, t, -t, 2*t],
    delta2: [-2*t, t, t, -t],
    delta3: [0, t, 2*t, -2*t],
    delta1p:[1, -1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
    delta2p:[-1, 1, 0, 0, 0, 0, 0, 0, -1, -1, 1, 0, 0, 1],
    delta3p:[1, 0, 1, 1, 1, 0, 0, 0, -1, 0, 0, 0, 1, -1]
};

const allTasks = {
    1: task0, 
    2: task1, 
    3: task2, 
    4: task3, 
    5: task4, 
    6: task5, 
    7: task6, 
    8: task7, 
    9: task8, 
    10: task9, 
    11: task10, 
    12: task11
}

let situations = [];

// Populate situations based on category
function genSituations() {
    console.log(sessionStorage.category);
    console.log(sessionStorage.language);

    let instanceMap = JSON.parse(categories);

    instanceMap[sessionStorage.category].sort(() => Math.random() - 0.5).forEach((taskId, index) => {
        situations.push(allTasks[taskId]);
    });

    console.log(situations);
}

genSituations();
